       IDENTIFICATION DIVISION.
       PROGRAM-ID. RelativeFileExample.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STUDENT-FILE ASSIGN TO 'STUDENTS.DAT' 
                  ORGANIZATION IS RELATIVE 
                  ACCESS MODE IS RANDOM 
                  RELATIVE KEY IS WS-STUDENT-ID.

       DATA DIVISION.
       FILE SECTION.
       FD STUDENT-FILE.
       01 STUDENT-RECORD.
           05 FILE-STUDENT-ID       PIC 9(4).
           05 STUDENT-NAME         PIC X(20).
           05 STUDENT-GRADE        PIC X(1).

       WORKING-STORAGE SECTION.
       01 WS-STUDENT-ID             PIC 9(4).
       01 WS-END-OF-FILE             PIC X(1)   VALUE 'N'.
       01 WS-RESPONSE-CODE           PIC 99     VALUE ZERO.

       PROCEDURE DIVISION.
       A000-START.
           OPEN OUTPUT STUDENT-FILE.

           MOVE 1 TO WS-STUDENT-ID.
           MOVE WS-STUDENT-ID TO FILE-STUDENT-ID.
           MOVE 'John Doe' TO STUDENT-NAME.
           MOVE 'A' TO STUDENT-GRADE.
           WRITE STUDENT-RECORD INVALID KEY DISPLAY 'WRITE ERROR JOHN'.

           MOVE 2 TO WS-STUDENT-ID.
           MOVE WS-STUDENT-ID TO FILE-STUDENT-ID.
           MOVE 'Jane Smith' TO STUDENT-NAME.
           MOVE 'B' TO STUDENT-GRADE.
           WRITE STUDENT-RECORD INVALID KEY DISPLAY 'WRITE ERROR JANE'.

           CLOSE STUDENT-FILE.

           STOP RUN.
