       IDENTIFICATION DIVISION.
       PROGRAM-ID.  Tables.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MONTH-NAMES.
         05 MONTH-NAME OCCURS 12 TIMES PIC X(10).
       01 SALES-TABLE.
         05 MONTHLY-SALES OCCURS 12 TIMES.
            10 DAILY-SALES OCCURS 31 TIMES PIC 9(5).

       PROCEDURE DIVISION.
           MOVE 'JANUARY' TO MONTH-NAME(1).
           MOVE 'FEBRUARY' TO MONTH-NAME(2).

           MOVE 1000 TO DAILY-SALES (1, 1).
           MOVE 2000 TO DAILY-SALES (1, 2).

           DISPLAY MONTH-NAME(1) ' ' MONTH-NAME(2).
           DISPLAY MONTH-NAME(1) '/' 1 '=' DAILY-SALES (1, 1).
           DISPLAY MONTH-NAME(2) '/' 1 '=' DAILY-SALES (1, 2).
           STOP RUN.

       END PROGRAM Tables.


